app/Controllers/Customers.php

SELECT *
FROM `customers`
ORDER BY `id` DESC
INSERT INTO `customers` (`full_name`, `email`, `phone`, `created_at`) VALUES ('Samantha', 'gilquilong@gmail.com', '0912345678', '2026-10-06 06:50:20')
---
    public function index() { return view('customers/index', ['customers'=>(new CustomerModel())->orderBy('id','DESC')->findAll()]); }
    public function create()
    {
        if ($this->request->is('post')) {
            if (! $this->validate(['full_name'=>'required|max_length[100]','email'=>'required|valid_email','phone'=>'permit_empty|max_length[20]'])) return view('customers/form',['errors'=>$this->validator->getErrors()]);
            (new CustomerModel())->insert(['full_name'=>$this->request->getPost('full_name'),'email'=>$this->request->getPost('email'),'phone'=>$this->request->getPost('phone'),'created_at'=>date('Y-m-d H:i:s')]); return redirect()->to('/customers')->with('success','Customer added.');