app/Controllers/Products.php

SELECT *
FROM `products`
ORDER BY `id` DESC
---
    public function index() { return view('products/index', array_merge($this->pageData(), ['products' => (new ProductModel())->orderBy('id', 'DESC')->findAll()])); }