app/Controllers/Sales.php

    public function index()
    {
        $db=\Config\Database::connect(); $sales=$db->table('sales s')->select('s.*,p.name product_name,c.full_name customer_name,u.full_name staff_name')->join('products p','p.id=s.product_id')->join('customers c','c.id=s.customer_id','left')->join('users u','u.id=s.sold_by')->orderBy('s.id','DESC')->get()->getResultArray(); return view('sales/index',['sales'=>$sales]);
---
SELECT `s`.*, `p`.`name` `product_name`, `c`.`full_name` `customer_name`, `u`.`full_name` `staff_name`
FROM `sales` `s`
JOIN `products` `p` ON `p`.`id`=`s`.`product_id`
LEFT JOIN `customers` `c` ON `c`.`id`=`s`.`customer_id`
JOIN `users` `u` ON `u`.`id`=`s`.`sold_by`
ORDER BY `s`.`id` DESC

    public function create()
    {
        $products=new ProductModel();
        if ($this->request->is('post')) {
            $product=$products->find($this->request->getPost('product_id')); $quantity=(int)$this->request->getPost('quantity');
            if (! $product || $quantity<1) return redirect()->back()->withInput()->with('error','Select a valid product and quantity.');
            if ($quantity>(int)$product['stock_quantity']) return redirect()->back()->withInput()->with('error','Sale rejected: requested quantity exceeds available stock.');
            $db=\Config\Database::connect(); $db->transStart(); $products->update($product['id'],['stock_quantity'=>$product['stock_quantity']-$quantity]); (new SaleModel())->insert(['product_id'=>$product['id'],'customer_id'=>$this->request->getPost('customer_id')?:null,'sold_by'=>session()->get('user_id'),'quantity'=>$quantity,'total_price'=>$quantity*(float)$product['price'],'created_at'=>date('Y-m-d H:i:s')]); $db->transComplete();
---
SELECT *
FROM `products`
WHERE `products`.`id` = '8'
INSERT INTO `sales` (`product_id`, `customer_id`, `sold_by`, `quantity`, `total_price`, `created_at`) VALUES ('8', '2', '1', 1, 2200, '2026-10-06 06:49:39')
SELECT *
FROM `products`
WHERE `stock_quantity` > 0