app/Controllers/Users.php

    public function index() { return view('users/index',['users'=>(new UserModel())->orderBy('id','DESC')->findAll()]); }
---
SELECT *
FROM `users`
ORDER BY `id` DESC